Kikkert2012/PorousLayer_boundaryCondition_2D/0_orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    "(wall|floor)"
    {
        type            kqRWallFunction;
        value           uniform 1e-5;
    }

    beach
    {
        type            kqRWallFunction;
        value           uniform 1e-5;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1e-5;
        value           uniform 1e-5;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
