Kikkert2012/PorousLayer_boundaryCondition_2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (5.1906 0 0)
    (5.1906 0.053 0)
    (0 0.053 0)
    (0 0 0.1)
    (5.1906 0 0.1)
    (5.1906 0.053 0.1)
    (0 0.053 0.1)

    
    (0 0.65 0)
    (5.1906 0.65 0)
    (5.1906 1 0)
    (0 1 0)
    (0 0.65 0.1)
    (5.1906 0.65 0.1)
    (5.1906 1 0.1)
    (0 1 0.1)
    
    (12.1906 0.7 0)
    (12.1906 0.7 0.1)
    (12.1906 0.753 0)
    (12.1906 0.753 0.1)
    (12.1906 1.35 0)
    (12.1906 1.35 0.1)
    (12.1906 1.7 0)
    (12.1906 1.7 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (519 42 1) simpleGrading (1 1763.7 1)
    hex (3 2 9 8 7 6 13 12) (519 60 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (519 19 1) simpleGrading (1 3.032 1)
    hex (1 16 18 2 5 17 19 6) (700 42 1) simpleGrading (1 1763.7 1)
    hex (2 18 20 9 6 19 21 13) (700 60 1) simpleGrading (1 1 1)
    hex (9 20 22 10 13 21 23 14) (700 19 1) simpleGrading (1 3.032 1)
);

edges
(
);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (3 8 12 7)
            (8 11 15 12)
            
        );
    }
    
    floor
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    beach
    {
        type wall;
        faces
        (
            (1 5 17 16)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (11 10 14 15)
            (10 22 23 14)
            (16 17 19 18)
            (18 19 21 20)
            (20 21 23 22)
        );
    }
    front
    {
    	type empty;
    	faces
    	(
            (0 1 2 3)
            (3 2 9 8)
            (8 9 10 11)
            (1 16 18 2)
            (2 18 20 9)
            (9 20 22 10)
        );
    }
    back
    {
    	type empty;
    	faces
    	(
            (4 7 6 5)
            (7 12 13 6)
            (12 15 14 13)
            (5 6 19 17)
            (6 13 21 19)
            (13 14 23 21)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
