Kikkert2012/PorousLayer_boundaryCondition_2D/system/gradU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

gradU
{
    // Mandatory entries
    type            grad;
    libs            (fieldFunctionObjects);

    // Optional entries
    field	    U;
    writeControl    writeTime;	
}


// ************************************************************************* //
