Kikkert2012/PorousLayer_boundaryCondition_2D/system/sonde2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

sonde2
{
    start   (5.87464 0.069161 0);
    end     (5.78156 1.000001 0);
    fields  (U alpha.water k nut grad(U));

    #includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

    setConfig
    {
        axis    xyz;
        nPoints	1001;
    }

    // Must be last entry
    #includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}


// ************************************************************************* //
